title: Test Rule
status: experimental
description: Test the successful installation of Sigma Hunting App in Splunk
references:
    - None
tags:
    - attack.t1078
    - attack.initial_access
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4624
        signature: 'An account was successfully logged on'
        Account_Name: 'ANONYMOUS LOGON'
    condition: selection
fields:
    - EventCode
    - signature
    - Account_Name
falsepositives:
    - Benign
    - Should result in lots of findings
level: low
